In [1]:
import pandas as pd

1. titanic.csv数据清洗

In [ ]:
df = pd.read_csv('./titanic/titanic.csv')

当前工作路径： d:\WorkSpace\AI\notebooks\week2\day2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

统计每列缺失数量

In [ ]:
d = df.isna().sum()
d

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

缺失值处理：Age、Cabin、Embarked 用不同策略（均值、众数、删除）

In [9]:
df['Age'].fillna(df['Age'].mean(), inplace=True)
mode_cabin = df['Cabin'].mode()[0]   # 取众数
df['Cabin'].fillna(mode_cabin, inplace=True)
df.dropna(subset=['Embarked'], inplace=True)
d = df.isna().sum()
d

C:\Users\18640\AppData\Local\Temp\ipykernel_22180\3243411493.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\18640\AppData\Local\Temp\ipykernel_22180\3243411493.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Cabin'].fillna(mode_cabin, inplace=True)

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

异常值处理：Fare > 300 视为异常 → 截断 Winsorize

In [10]:
df['Fare'] = df['Fare'].clip(upper=300)

重复值检查

In [11]:
du_sum = df.duplicated().sum()
du_sum

np.int64(0)

重命名列：统一小写+下划线

In [12]:
# 1) 先统一转小写
# 2) 再把空格、点、连字符等常见分隔符替换成下划线
# 3) 如有连续多个下划线或首尾下划线，可再用正则合并/去除
df.columns = (df.columns
                .str.lower()
                .str.replace(r'[^\w]+', '_', regex=True)   # 非字母数字→下划线
                .str.strip('_'))                           # 去掉首尾多余下划线

# 保存或继续处理
df.to_csv('./titanic/titanic_clean.csv', index=False)

2. GlobalTemperatures.csv数据清洗

In [ ]:
df = pd.read_csv('./GlobalTemperatures/GlobalTemperatures.csv')